#Напишите скрипт, который позволяет ввести с клавиатуры номер
#дебетовой карты (16 цифр) и выводит номер в скрытом виде: первые и
#последние 4 цифры отображены нормально, а между ними – символы
#«*» (например, 5123 **** **** 1212).
while True:
    try:
        number = (input("Введите номер карты(16 цифр): "))
        if not len(number) == 16 or not number.isdigit():
            raise ValueError
    except ValueError as e:
        print("Невереный формат")
    else:
        print(number[:4] + '*' * 8 + number[-4:])
