#Напишите скрипт, который преобразует введенное с клавиатуры
#вещественное число в денежный формат. Например, число 12,5 должно
#быть преобразовано к виду «12 руб. 50 коп.». В случае ввода
#отрицательного числа выдайте сообщение «Некорректный формат!»
#путем обработки исключения в коде.
try:
    s = (input("Введите вещественное число: "))
    if float(s) < 0:
        raise ValueError
except ValueError as e:
    print("Некорректный формат", e)
else:
    res = s.split(".")
    print("{} руб. {} коп.".format(res[0], res[1]))
